
start = '''Привет, будущий стобалльник! 🎓✨
Я — твой личный помощник в подготовке к ЕГЭ. Здесь ты найдешь всё, что нужно для успешной сдачи экзаменов:
📚 Теория по по информатике, математике и физике
📝 Практические задания и тесты
📊 Прогресс и рекомендации
🎯 Советы по тайм-менеджменту и мотивации

Давай начнем! Выбери предмет:
/math — Профильная математика
/phys — Физика
/inf - Информатика
/help — Помощь

Помни: ЕГЭ — это не страшно, если готовиться с умом! 🚀'''

help = '''📌 Помощь и инструкции

Привет! Я — твой помощник в подготовке к ЕГЭ. Вот что я могу для тебя сделать:

📚 Основные команды:
/start — Начать работу с ботом
/math — Подготовка к ЕГЭ по профильной  математике
/phys — Подготовка к ЕГЭ по физике
/tips — Полезные советы по подготовке

📝 Как пользоваться ботом:

Выбери предмет, который хочешь изучать.

Решай задания и читай теорию.

Если что-то непонятно, просто напиши мне — я постараюсь помочь!


Если у тебя остались вопросы или что-то не работает, напиши сюда: @bat9ath0me.

Удачи в подготовке! Ты справишься! 💪🎓'''

TIPS = '''📚 Полезные советы для успешной сдачи ЕГЭ:
1. 🧮 Регулярность занятий
Уделяйте внимание занятиям ежедневно. Лучше заниматься небольшими порциями каждый день, чем устраивать марафонские сессии накануне экзамена. Так материал усваивается глубже и эффективнее.

2. ✏️ Разбор теоретического материала
Обязательно повторяйте теорию, изученную в школе. Даже если кажется, что материал известен, систематический обзор поможет закрепить основы и избежать ошибок.

3. ⚙️ Тренировка решения задач
Практика решает всё. Чем больше решаете задач разного типа, тем легче справитесь с неожиданными вопросами на экзамене. Особое внимание уделите решению нестандартных задач, поскольку именно они вызывают наибольшие трудности.

4. 📌 Использование официальных демоверсий
Регулярно выполняйте тренировочные тесты, опубликованные Федеральным институтом педагогических измерений (ФИПИ). Эти материалы позволяют познакомиться с форматом экзаменационных вопросов и заранее привыкнуть к стилю подачи заданий.

5. 🔍 Освоение методов быстрого счета
Научитесь считать устно и эффективно пользоваться калькулятором. Особенно полезно освоить быстрые методы умножения, деления и упрощения выражений, чтобы экономить время на экзамене.

6. 💡 Анализ своих ошибок
Записывайте ошибки, допущенные при выполнении тестов, и периодически возвращайтесь к ним. Повторение пройденного материала помогает исключить похожие ошибки в будущем.

7. 🗂️ Работа над оформлением решений
Особое внимание обратите на оформление решений задач. Четко записанные шаги повышают шансы на максимальный балл даже при частичном решении задачи.

8. 🎯 Постановка целей и мониторинг прогресса
Определите целевые баллы по каждой дисциплине и контролируйте свое продвижение. Важно видеть прогресс и понимать, насколько близко вы подошли к поставленной цели.

9. 🕑 Соблюдение тайминга
Во время тренировок соблюдайте ограничения по времени. Таким образом, вы сможете научиться правильно распределять силы и время на реальных экзаменах.

10. 😀 Поддерживайте позитивный настрой
Психологическое состояние играет важную роль. Стресс негативно влияет на качество выполнения заданий. Подготовьте себя морально, поддерживая уверенность в собственных силах и положительный настрой.

11. 🛠️ Совершенствование техники рисования схем и диаграмм
При подготовке к экзамену по физике особое внимание уделите способности рисовать схемы и диаграммы качественно и аккуратно. Правильное представление информации визуально также приносит дополнительные баллы.

12. 🖥️ Используйте современные технологии
Используйте онлайн-ресурсы и мобильные приложения для подготовки. Многие сервисы предлагают тренировки и разборы типовых задач, которые помогают быстрее разобраться в материале.'''